package TelegramBotAAC;

public class Messages {
    public static final String HELP_TEXT = """
        📚 *הוראות שימוש בבוט:*

        /add — הוספת משימה חדשה.
        /list — הצגת כל המשימות הפתוחות שלך, כולל ימים שנותרו או איחור.
        /update — סימון משימה כהוגשה או ביטול הגשה.
        /taskpush — הפעלת או ביטול קבלת מטלות באופן אוטומטי.
        /help — הצגת הוראות שימוש.
        

        📅 *הערות לגבי תאריכים:*
        יש להזין תאריך בפורמט: yyyy-MM-dd  
        לדוגמה: 2025-07-20

        🔔 כל יום ב-20:00 תישלח לך תזכורת אוטומטית על כל המשימות הפתוחות שלך.
        """;

    public static final String START_MESSAGE = """
        🎓 *ברוך הבא למערכת ניהול המשימות של התואר שלנו!*

        ✅ כל המשימות שפתוחות נוספו אוטומטית לרשימה האישית שלך.
        ✅ אין צורך להוסיף בעצמך משימות שכבר קיימות — הכל מתעדכן לבד.
        ✅ בכל יום ב-20:00 תקבל תזכורת עם המשימות שלך.

        📝 תוכל להשתמש בפקודות:
        /list — לראות את המשימות שלך  
        /update — לסמן שהגשת משימות או לבטל הגשה  
        /taskpush — לבטל או להפעיל מחדש קבלת מטלות מהאדמין באופן אוטומטי
        /help — לראות שוב את כל ההוראות  
        

        ⚠️ *מומלץ להשאיר את קבלת המטלות פעילה* — כל המשימות של הקורסים שלנו יועלו כאן אוטומטית לאחר קבלתן, כדי שלא תפספסו כלום!

        🚀 שיהיה בהצלחה בלימודים! ואם יש בעיות — תדברו איתי 😉
        
        👨‍💻 נבנה באהבה על ידי נהוראי
        """;

}
